RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_usbhs_library/driver/Include/drv_usb_regs.h
/* host non-periodic transmit FIFO/queue status register bits definitions */
#define HNPTFQSTAT_NPTXRQTOP      BITS(24,30)         /*!< top entry of the non-periodic Tx request queue */
#define HNPTFQSTAT_NPTXRQS        BITS(16,23)         /*!< non-periodic Tx request queue space */
#define HNPTFQSTAT_NPTXFS         BITS(0,15)          /*!< non-periodic Tx FIFO space */
#define HNPTFQSTAT_CNUM           BITS(27,30)         /*!< channel number*/
#define HNPTFQSTAT_EPNUM          BITS(27,30)         /*!< endpoint number */
#define HNPTFQSTAT_TYPE           BITS(25,26)         /*!< token type */
#define HNPTFQSTAT_TMF            BIT(24)             /*!< terminate flag */

/* global core configuration register bits definitions */
#define GCCFG_VDEN                BIT(21)             /*!< enable of VBUS sensing comparator to detect VBUS valid */
#define GCCFG_SOFOEN              BIT(20)             /*!< SOF output enable */
#define GCCFG_PWRON               BIT(16)             /*!< power on */
#define GCCFG_SDMEN               BIT(15)             /*!< secondary detection mode enable */
#define GCCFG_PEMEN               BIT(14)             /*!< primary detection mode enable */
#define GCCFG_DCDEN               BIT(13)             /*!< data connect detection mode enable */
#define GCCFG_BCDEN               BIT(12)             /*!< battery charging detection enable */
#define GCCFG_PS2F                BIT(3)              /*!< PS2 detection status */
#define GCCFG_SDF                 BIT(2)              /*!< secondary detection status */
#define GCCFG_PDF                 BIT(1)              /*!< primary detection status */
#define GCCFG_DCDF                BIT(0)              /*!< battery connect detection status */

/* core ID register bits definitions */
#define CID_CID                   BITS(0,31)          /*!< core ID */

/* global core LPM configuration register bits definitions */
#define GLPMCFG_BESLEN            BIT(28)             /*!< LPM Errata selection enable */
#define GLPMCFG_LPMRCS            BITS(25,27)         /*!< LPM retry count status */
#define GLPMCFG_LPMSND            BIT(24)             /*!< send LPM transaction */
#define GLPMCFG_LPMRC             BITS(21,23)         /*!< LPM retry count */
#define GLPMCFG_LPMCHI            BITS(17,20)         /*!< channel number index */
#define GLPMCFG_RSOK              BIT(16)             /*!< Resume can be sent after sleep state */
#define GLPMCFG_LPMSLPS           BIT(15)             /*!< sleep status */
#define GLPMCFG_LPMRSP            BITS(13,14)         /*!< response of LPM */
#define GLPMCFG_DSEN              BIT(12)             /*!< deep sleep enable */
#define GLPMCFG_BESLTH            BITS(8,11)          /*!< BESL threshold */
#define GLPMCFG_SSEN              BIT(7)              /*!< shallow sleep enable */
#define GLPMCFG_REW               BIT(6)              /*!< bRemoteWake value */
#define GLPMCFG_BESL              BITS(2,5)           /*!< best effort service latency */
#define GLPMCFG_ACKLPM            BIT(1)              /*!< ACK in LPM transaction enable */
#define GLPMCFG_LPMEN             BIT(0)              /*!< LPM enable */

/* power down register bits definition */
#define PWRD_ADPF                 BIT(23)             /*!< ADP event interrupt flag */
#define PWRD_ADPMEN               BIT(0)              /*!< ADP module enable */

/* ADP control and status register bits definition */
#define ADPCTL_RWR                BITS(27,28)         /*!< read and write request */
#define ADPCTL_ADPTFM             BIT(26)             /*!< the mask of ADP timeout interrupt flag */
#define ADPCTL_ADPSNFM            BIT(25)             /*!< the mask of ADP sense interrupt flag */
#define ADPCTL_ADPPRFM            BIT(24)             /*!< the mask of ADP probe interrupt flag */
#define ADPCTL_ADPTF              BIT(23)             /*!< ADP timeout interrupt flag */
#define ADPCTL_ADPSNF             BIT(22)             /*!< ADP sense interrupt flag */
#define ADPCTL_ADPPRF             BIT(21)             /*!< ADP probe interrupt flag */
#define ADPCTL_ADPEN              BIT(20)             /*!< ADP enable */
#define ADPCTL_ADPRST             BIT(19)             /*!< ADP reset */
#define ADPCTL_SNEN               BIT(18)             /*!< ADP sense enable */
#define ADPCTL_PREN               BIT(17)             /*!< ADP probe enable */
#define ADPCTL_CHGT               BITS(6,16)          /*!< the latest time that VBUS ramps from VADPSINK to VADPPRB */
#define ADPCTL_PERPR              BITS(4,5)           /*!< period of probe */
#define ADPCTL_RESOPR             BITS(2,3)           /*!< the resolution of CHGT value */
#define ADPCTL_DSCHGPR            BITS(0,1)           /*!< Time of probe discharge */

/* USBHS PHY control register bits definitions */
#define PHYCTL_HS_CALEN           BIT(31)             /*!< HS PHY calibration enable */
#define PHYCTL_HS_CALR            BITS(25,30)         /*!< HS PHY calibration value */
#define PHYCTL_HS_RCALR           BITS(21,24)         /*!< HS PHY R calibration value */
#define PHYCTL_SQUECH             BIT(16)             /*!< HS PHY squech flag */ 
#define PHYCTL_HS_BIST_DONE       BIT(15)             /*!< HS PHY bist finished flag */
#define PHYCTL_HS_BIST_SUCCESS    BIT(14)             /*!< HS PHY bist success flag */
#define PHYCTL_HS_BIST_FAIL       BIT(13)             /*!< HS PHY bist fail flag */
#define PHYCTL_HS_BIST_PKT_SEL    BITS(11,12)         /*!< HS PHY bist packet select */
#define PHYCTL_HS_BIST_SEED       BITS(3,10)          /*!< HS PHY bist seed */
#define PHYCTL_HS_BIST_EN         BIT(2)              /*!< HS PHY bist enable */
#define PHYCTL_HS_BIST_RESET      BIT(1)              /*!< HS PHY bist logic reset */
#define PHYCTL_HS_BIST_START      BIT(0)              /*!< HS PHY bist start */

/* host periodic transmit FIFO length register bits definitions */
#define HPTFLEN_HPTXFD            BITS(16,31)         /*!< host periodic Tx FIFO depth */
#define HPTFLEN_HPTXFSAR          BITS(0,15)          /*!< host periodic Tx RAM start address */

/* device IN endpoint transmit FIFO length register bits definitions */
#define DIEPTFLEN_IEPTXFD         BITS(16,31)         /*!< IN endpoint Tx FIFO x depth */
#define DIEPTFLEN_IEPTXRSAR       BITS(0,15)          /*!< IN endpoint FIFOx Tx x RAM start address */

