RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_usbhs_library/driver/Include/drv_usb_regs.h
#define DOEP0_TLEN(regval)        (DOEP0LEN_TLEN & ((regval) << 0U))    /*!< Transfer length */
#define DOEP0_PCNT(regval)        (DOEP0LEN_PCNT & ((regval) << 19U))   /*!< Packet count */
#define DOEP0_STPCNT(regval)      (DOEP0LEN_STPCNT & ((regval) << 29U)) /*!< SETUP packet count */

#define GRXSTS_PKTSTS_IN                        2U
#define GRXSTS_PKTSTS_IN_XFER_COMP              3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR           5U
#define GRXSTS_PKTSTS_CH_HALTED                 7U

#define DEVICE_MODE                             0U                      /*!< device mode */
#define HOST_MODE                               1U                      /*!< host mode */
#define OTG_MODE                                2U                      /*!< OTG mode */

#define HCTL_30_60MHZ                           0U                      /*!< USB clock 30-60MHZ */
#define HCTL_48MHZ                              1U                      /*!< USB clock 48MHZ */
#define HCTL_6MHZ                               2U                      /*!< USB clock 6MHZ */

#define USBHS_MAX_PACKET_SIZE                   512U                    /*!< USBHS max packet size */
#define USBHS_MAX_CHANNEL_COUNT                 16U                     /*!< USBHS host channel count */     
#define USBHS_MAX_EP_COUNT                      8U                      /*!< USBHS device endpoint count */    
#define USBHS_MAX_FIFO_WORDLEN                  1280U                   /*!< USBHS max fifo size in words */

#define USB_DATA_FIFO_OFFSET                    0x1000U                 /*!< USB data fifo offset */
#define USB_DATA_FIFO_SIZE                      0x1000U                 /*!< USB data fifo size */

/* check peripherals */
#define NOT_USB_PERIPH(periph)    ((USBHS0 != (periph)) && (USBHS1 != (periph)))

/* check USB speed */
#define NOT_USB_VALID_SPEED(speed) ((USB_SPEED_FULL != speed) && (USB_SPEED_HIGH != speed))

/* check USB endpoint */
#define NOT_USB_EP(ep_num)        ((ep_num) >= 8U)

/* check USB endpoint address */
#define NOT_USB_EPADDR(ep_addr)   (0U != ((ep_addr) & 0x78U))

/* check USB channel */
#define NOT_USB_CH(ch_num)        ((ch_num) >= 16U)

/* check the invalid pointer */
#define NOT_USB_VALID_POINTER(x)  ((void *)0 == (x))

/* check the invalid byte count */
#define NOT_VALID_LEN(len)        ((len) > 4096)

/* check USB mode */
#define NOT_USB_VALID_MODE(mode)  ((DEVICE_MODE != (mode)) && (HOST_MODE != (mode)))

typedef enum
{
    USB_EMBEDDED_PHY_FS = 0U,                                           /*!< USB embedded FS PHY */
    USB_EMBEDDED_PHY_HS,                                                /*!< USB embedded HS PHY */
    USB_ULPI_PHY_EXTERNAL                                               /*!< USB external ULPI PHY */
} usb_phy_enum;

enum usb_reg_offset {
    USB_REG_OFFSET_CORE      = 0x0000U,                                 /*!< global OTG control and status register */
    USB_REG_OFFSET_DEV       = 0x0800U,                                 /*!< device mode control and status registers */
    USB_REG_OFFSET_EP        = 0x0020U,                                 /*!< offset of each endpoint */
    USB_REG_OFFSET_EP_IN     = 0x0900U,                                 /*!< device IN endpoint 0 control register */
    USB_REG_OFFSET_EP_OUT    = 0x0B00U,                                 /*!< device OUT endpoint 0 control register */
    USB_REG_OFFSET_HOST      = 0x0400U,                                 /*!< host control register */
    USB_REG_OFFSET_CH        = 0x0020U,                                 /*!< offset of each channel */
    USB_REG_OFFSET_PORT      = 0x0440U,                                 /*!< host port control and status register */
    USB_REG_OFFSET_CH_INOUT  = 0x0500U,                                 /*!< host channel-x control registers */
    USB_REG_OFFSET_PWRCLKCTL = 0x0E00U                                  /*!< power and clock register */
};

enum USB_SPEED {
    USB_SPEED_UNKNOWN = 0,                                              /*!< USB speed unknown */
    USB_SPEED_LOW,                                                      /*!< USB speed low */
    USB_SPEED_FULL,                                                     /*!< USB speed full */
    USB_SPEED_HIGH                                                      /*!< USB speed high */
};

#define EP0_OUT                                 ((uint8_t)0x00U)        /*!< endpoint out 0 */
#define EP0_IN                                  ((uint8_t)0x80U)        /*!< endpoint in 0 */
#define EP1_OUT                                 ((uint8_t)0x01U)        /*!< endpoint out 1 */
#define EP1_IN                                  ((uint8_t)0x81U)        /*!< endpoint in 1 */
#define EP2_OUT                                 ((uint8_t)0x02U)        /*!< endpoint out 2 */
#define EP2_IN                                  ((uint8_t)0x82U)        /*!< endpoint in 2 */
#define EP3_OUT                                 ((uint8_t)0x03U)        /*!< endpoint out 3 */
#define EP3_IN                                  ((uint8_t)0x83U)        /*!< endpoint in 3 */
#define EP4_OUT                                 ((uint8_t)0x04U)        /*!< endpoint out 4 */
#define EP4_IN                                  ((uint8_t)0x84U)        /*!< endpoint in 4 */
#define EP5_OUT                                 ((uint8_t)0x05U)        /*!< endpoint out 5 */
#define EP5_IN                                  ((uint8_t)0x85U)        /*!< endpoint in 5 */
#define EP6_OUT                                 ((uint8_t)0x06U)        /*!< endpoint out 6 */
#define EP6_IN                                  ((uint8_t)0x86U)        /*!< endpoint in 6 */
#define EP7_OUT                                 ((uint8_t)0x06U)        /*!< endpoint out 7 */
#define EP7_IN                                  ((uint8_t)0x86U)        /*!< endpoint in 7 */

#endif /* DRV_USB_REGS_H */
